In [53]:
import pandas as pd
import numpy as np

In [54]:
cafe = pd.read_csv('./result/고유 ID.csv',sep=',',encoding='utf8')
cafe.head()

   Unnamed: 0       상호명  지점명                 도로명주소          경도         위도  ID
0           0       펠로톤  NaN       강원도 강릉시 임영로 115  128.893468  37.751919  강릉
1           1  키즈까페아이사랑  NaN    강원도 강릉시 성덕포남로 45-8  128.919456  37.759315  강릉
2           2     상유재카페  NaN  강원도 정선군 정선읍 정선로 1323  128.660805  37.379458  정선
3           3     동물과사람  NaN      강원도 원주시 천매봉길 117  127.943047  37.326277  원주
4           4     카페비엔또  NaN   강원도 영월군 영월읍 중앙1로 59  128.465690  37.186503  영월

In [55]:
del cafe['Unnamed: 0']

In [56]:
cafe['상호명'] = cafe['상호명'].str.lower()

In [105]:
(cafe[cafe['ID']=='영월']['상호명'].str.find('스타벅스')>=0).to_numpy()

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False])

# (스타벅스 + 커피빈) / (이디야 + 빽다방)
- 그리고 ID로 pivot_table 이후 aggfunc = 'count'

## 1. 스타벅스

In [58]:
star_kr1 = cafe[cafe['상호명'].str.find('스타벅스') >= 0]
star_kr1.shape

(1633, 6)

In [59]:
star_kr2 = cafe[cafe['상호명'].str.find('스타박스') >= 0]
star_kr2.shape

(4, 6)

In [60]:
star_en = cafe[cafe['상호명'].str.find('starbucks') >= 0]
star_en.shape

(4, 6)

In [61]:
star = pd.concat([star_kr1,star_kr2,star_en])
star

,상호명,지점명,도로명주소,경도,위도,ID
16,스타벅스,NaN,강원도 원주시 금불1길 28-5,127.931032,37.348466,원주
167,스타벅스,오션월드2호점,강원도 홍천군 서면 한치골길 262,127.687273,37.652324,홍천
398,스타벅스,대명델피노리조트점,강원도 고성군 토성면 미시령옛길 1153,128.493408,38.213128,고성(강원)
439,스타벅스,강대점,강원도 춘천시 서부대성로 243-1,127.745087,37.872760,춘천
679,스타벅스,속초중앙로점,강원도 속초시 중앙로 123,128.589463,38.202621,속초
...,...,...,...,...,...,...
55574,스타박스,NaN,부산광역시 남구 황령대로74번길 47,129.067570,35.147797,부산 남구
11459,starbuckscoffee,NaN,경기도 의정부시 행복로 7,127.048140,37.739587,의정부
16554,starbuckscoffee,NaN,경기도 성남시 분당구 판교역로192번길 14,127.111395,37.397375,성남 분당
32141,starbuckscoffee,NaN,경상남도 김해시 가야로 182,128.871703,35.261544,김해
63572,starbuckscoffee,NaN,서울특별시 서초구 신반포로 176,127.002393,37.503930,서울 서초

In [62]:
star_count = pd.pivot_table(data = star,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
star_count.rename(columns={
    '상호명':'개수'
},inplace=True)
star_count.reset_index(inplace=True)
star_count

     ID  개수
0    강릉   5
1    거제   5
2    경산   8
3    경주   8
4    계룡   1
..   ..  ..
185  하남  10
186  하동   1
187  함양   1
188  홍천   2
189  화성  19

[190 rows x 2 columns]

## 2. 커피빈

In [63]:
bean_kr = cafe[cafe['상호명'].str.find('커피빈') >= 0]
bean_kr.shape

(381, 6)

In [64]:
bean_en = cafe[cafe['상호명'].str.find('coffeebean') >= 0]
bean_en.shape

(3, 6)

In [65]:
bean = pd.concat([bean_kr,bean_kr])
bean

,상호명,지점명,도로명주소,경도,위도,ID
2141,커피빈,NaN,강원도 동해시 일출로 107,129.118963,37.552715,동해
2479,커피빈,코리아원주AK플라자점,강원도 원주시 봉화로 1,127.927626,37.345679,원주
3554,커피빈,곰씨네,강원도 춘천시 동내면 춘천순환로 61-15,127.751359,37.856311,춘천
4630,커피빈,NaN,경기도 이천시 남천로 93,127.447687,37.276730,이천
4860,커피빈,코리아수원인계점,경기도 수원시 팔달구 권광로 195,127.032669,37.264938,수원 팔달
...,...,...,...,...,...,...
102442,커피빈,파비뇽점,충청북도 청주시 흥덕구 월명로 212,127.455569,36.653705,청주 흥덕
102686,커피빈,NaN,충청북도 제천시 내제로 74,128.203104,37.136042,제천
103099,커피빈,코리아청주점,충청북도 청주시 상당구 상당로69번길 20,127.489295,36.634532,청주 상당
103485,커피빈,NaN,충청북도 음성군 금왕읍 무극로 281,127.592804,36.993018,음성
103671,커피빈,NaN,충청북도 제천시 죽하로 71-3,128.224848,37.158207,제천

In [66]:
bean_count = pd.pivot_table(data = bean,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
bean_count.rename(columns={
    '상호명':'개수'
},inplace=True)
bean_count.reset_index(inplace=True)
bean_count

        ID  개수
0       경주   4
1    고양 덕양   2
2   고양 일산동  10
3   고양 일산서  10
4    광주 남구   4
..     ...  ..
94   포항 북구   2
95      하남   2
96      함안   4
97      해남   2
98      화성  10

[99 rows x 2 columns]

## 3. 이디야

In [67]:
ediya_kr1 = cafe[cafe['상호명'].str.find('이디야') >= 0]
ediya_kr1.shape

(2103, 6)

In [68]:
ediya_kr2 = cafe[cafe['상호명'].str.find('이디아') >= 0]
ediya_kr2.shape

(120, 6)

In [69]:
ediya_en = cafe[cafe['상호명'].str.find('ediya') >= 0]
ediya_en.shape

(26, 6)

In [70]:
ediya = pd.concat([ediya_kr1,ediya_kr2,ediya_en])
ediya

,상호명,지점명,도로명주소,경도,위도,ID
42,이디야커피,우두동점,강원도 춘천시 충열로 39,127.732714,37.899493,춘천
123,이디야커피,철원와수점,강원도 철원군 서면 와수로181번길 25-21,127.438109,38.239147,철원
153,이디야커피,하이원점,강원도 정선군 고한읍 하이원길 265-1,128.827807,37.209488,정선
288,이디야에스프레소,NaN,강원도 춘천시 시청길10번길 4-1,127.728578,37.880075,춘천
296,이디야커피,춘천애막골점,강원도 춘천시 후석로186번길 18,127.754289,37.867310,춘천
...,...,...,...,...,...,...
79245,ediya카페,NaN,세종특별자치시 세종특별자치시 한누리대로 283,127.256200,36.489409,세종
80446,ediyacoffee,NaN,울산광역시 남구 도산로 111,129.326996,35.530835,울산 남구
84086,ediyacoffee,NaN,인천광역시 부평구 동암광장로 10,126.702920,37.470990,인천 부평
84106,ediyacoffee,NaN,"인천광역시 미추홀구 경인로 129, (숭의동)",126.656702,37.466806,인천 미추홀
103077,ediyacoffee,충북괴산점,충청북도 괴산군 괴산읍 읍내로 293,127.794483,36.809391,괴산

In [71]:
ediya_count = pd.pivot_table(data = ediya,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
ediya_count.rename(columns={
    '상호명':'개수'
},inplace=True)
ediya_count.reset_index(inplace=True)
ediya_count

     ID  개수
0    가평   8
1    강릉  15
2    강진   1
3    거제   7
4    거창   1
..   ..  ..
231  홍성   4
232  홍천   3
233  화성  26
234  화천   1
235  횡성   1

[236 rows x 2 columns]

## 4. 빽다방

In [72]:
paik_kr = cafe[cafe['상호명'].str.find('빽다방') >= 0]
paik_kr.shape

(497, 6)

In [73]:
paik_en = cafe[cafe['상호명'].str.find('paik') >= 0]
paik_en.shape

(2, 6)

In [74]:
paik = pd.concat([paik_kr,paik_en])
paik

,상호명,지점명,도로명주소,경도,위도,ID
121,빽다방,NaN,강원도 원주시 무실로12번길 33,127.947781,37.350006,원주
599,빽다방,춘천석사CGV점,강원도 춘천시 지석로 85,127.744832,37.851125,춘천
677,빽다방,강릉금학점,강원도 강릉시 신대학길 14,128.894954,37.752800,강릉
777,빽다방,삼척대학로점,강원도 삼척시 대학로 23-8,129.163077,37.443281,삼척
1329,빽다방,원주단구GS점,강원도 원주시 남원로534번길 20,127.948675,37.330389,원주
...,...,...,...,...,...,...
104824,빽다방,청주지웰시티점,충청북도 청주시 흥덕구 대농로 39,127.426909,36.642332,청주 흥덕
105030,빽다방,청주금천광장점,충청북도 청주시 상당구 산성로98번길 35,127.505733,36.631051,청주 상당
105065,빽다방,청주오송점,충청북도 청주시 흥덕구 오송읍 오송생명5로 179,127.330310,36.630536,청주 흥덕
61066,빽다방paikscoffee,NaN,서울특별시 마포구 마포대로4길 16,126.946484,37.538757,서울 마포
63275,paikscoffee,NaN,서울특별시 송파구 올림픽로35길 104,127.099289,37.519810,서울 송파

In [75]:
paik_count = pd.pivot_table(data = paik,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
paik_count.rename(columns={
    '상호명':'개수'
},inplace=True)
paik_count.reset_index(inplace=True)
paik_count

         ID  개수
0        강릉   2
1        거창   1
2        경산   3
3        경주   2
4    고성(경남)   2
..      ...  ..
142   포항 북구   2
143      하남   1
144      홍성   2
145      홍천   1
146      화성  11

[147 rows x 2 columns]

# 커피 지수
- (스타벅스 + 커피빈) / (이디야 + 빽다방)

## 여러개의 DF을 한 번에 Join하기
- 이 방식은 행 이름이 중복되어서 들어감... 행 이름 바꿀 때 문제발생

In [76]:
from functools import reduce
dfs = [star_count, bean_count, ediya_count, paik_count]
# on = 'ID' 으로만 하면 교집합이 되어 버려서 몇 도시가 탈락된다.
CoffeeIndex = reduce(lambda left, right: pd.merge(left, right, how='outer', on='ID'), dfs)
CoffeeIndex = CoffeeIndex.fillna(0)
CoffeeIndex.set_index('ID',inplace=True)
CoffeeIndex

    개수_x  개수_y  개수_x  개수_y
ID
강릉   5.0   0.0  15.0   2.0
거제   5.0   0.0   7.0   0.0
경산   8.0   0.0   9.0   3.0
경주   8.0   4.0  25.0   2.0
계룡   1.0   0.0   1.0   0.0
..   ...   ...   ...   ...
합천   0.0   0.0   1.0   0.0
홍성   0.0   0.0   4.0   2.0
화천   0.0   0.0   1.0   0.0
횡성   0.0   0.0   1.0   0.0
예천   0.0   0.0   0.0   1.0

[241 rows x 4 columns]

In [89]:
CoffeeIndex.index.str.find('영월') >= 0

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False])

In [77]:
CoffeeIndex.columns

Index(['개수_x', '개수_y', '개수_x', '개수_y'], dtype='object')

In [78]:
CoffeeIndex.rename(columns={
    CoffeeIndex.columns[0]:'스타벅스',
    CoffeeIndex.columns[1]:'커피빈'
},inplace=True)
CoffeeIndex1 = CoffeeIndex.iloc[:,:2]

In [79]:
CoffeeIndex.rename(columns={
    CoffeeIndex.columns[2]:'이디야',
    CoffeeIndex.columns[3]:'빽다방'
},inplace=True)
CoffeeIndex2 = CoffeeIndex.iloc[:,2:]

In [80]:
CoffeeIndex = pd.concat([CoffeeIndex1,CoffeeIndex2],axis=1)
CoffeeIndex

    스타벅스  커피빈   이디야  빽다방
ID
강릉   5.0  0.0  15.0  2.0
거제   5.0  0.0   7.0  0.0
경산   8.0  0.0   9.0  3.0
경주   8.0  4.0  25.0  2.0
계룡   1.0  0.0   1.0  0.0
..   ...  ...   ...  ...
합천   0.0  0.0   1.0  0.0
홍성   0.0  0.0   4.0  2.0
화천   0.0  0.0   1.0  0.0
횡성   0.0  0.0   1.0  0.0
예천   0.0  0.0   0.0  1.0

[241 rows x 4 columns]

In [81]:
CoffeeIndex['커피지수'] = np.round((CoffeeIndex['스타벅스'] + CoffeeIndex['커피빈']) / (CoffeeIndex['이디야'] + CoffeeIndex['빽다방']),4)

In [82]:
CoffeeIndex

    스타벅스  커피빈   이디야  빽다방    커피지수
ID
강릉   5.0  0.0  15.0  2.0  0.2941
거제   5.0  0.0   7.0  0.0  0.7143
경산   8.0  0.0   9.0  3.0  0.6667
경주   8.0  4.0  25.0  2.0  0.4444
계룡   1.0  0.0   1.0  0.0  1.0000
..   ...  ...   ...  ...     ...
합천   0.0  0.0   1.0  0.0  0.0000
홍성   0.0  0.0   4.0  2.0  0.0000
화천   0.0  0.0   1.0  0.0  0.0000
횡성   0.0  0.0   1.0  0.0  0.0000
예천   0.0  0.0   0.0  1.0  0.0000

[241 rows x 5 columns]

# 무한대 처리
- 이디야, 빽다방이 하나도 없는 지역은 0으로 나누었기 때문에 값이 inf로 나온다.
- 무한대 값 inf는 np.inf로

In [83]:
CoffeeIndex[CoffeeIndex['커피지수']==np.inf]

    스타벅스  커피빈  이디야  빽다방  커피지수
ID
영양   1.0  0.0  0.0  0.0   inf
청양   1.0  0.0  0.0  0.0   inf
하동   1.0  0.0  0.0  0.0   inf
금산   0.0  2.0  0.0  0.0   inf

- np.inf, -np.inf값을 np.nan으로 바꾼 후 0으로 다시 바꿈

In [84]:
CoffeeIndex = CoffeeIndex.replace([np.inf, -np.inf],np.nan).fillna(0)

In [85]:
CoffeeIndex[CoffeeIndex.index.str.find('제주') >= 0]

    스타벅스  커피빈  이디야  빽다방  커피지수
ID
제주  13.0  0.0  6.0  4.0   1.3

In [86]:
CoffeeIndex.to_csv('./result/전국 커피 지수.csv',sep=',',encoding='utf8')